Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །མེ་ཏོག་སྣ་ཚོགས་རབ་དགང་ཞིང་། །སྤོས་དང་བྱུག་པ་སྣ་ཚོགས་དང་། །དུ་རུས་ཙནྡན་སཱ་ལ་ཀི། །ལྷ་ཡི་བདུག་པས་བདུག་བྱ་ཞིང་།
en: He should arrange various flowers, Smear the maṇḍala with various fragrant substances, Light lamps, and burn incense Of olibanum, sandalwood, and frankincense. “

source: །བུ་རམ་འོ་མ་བདུན་དང་ནི། །རིལ་བུ་ལེགས་སྦྱར་བཟའ་བར་བྱ། །གསང་བ་འདི་འཐུངས་མོད་ལ་ནི། །བཏུང་དང་ཁ་ཟས་བཟའ་བར་བྱ།
en: He should consume the pill With seven times the amount of milk and sugar, Drink this secret drink all at once, And then eat his food. “

source: །མགོན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་། །མཆོག་སྦྱིན་མཛད་པར་མཆོད་པར་བྱ།
en: He should worship Lord Avalokiteśvara, The granter of boons.

source: །བྱམས་མཛད་དེ་ཡི་ཞབས་དྲུང་དུ། །མཚན་མོ་ཉལ་དང་ནང་པར་ནི། །མཐོང་བ་མཆོག་འདི་ཐོབ་པར་འགྱུར།
en: Then, sleeping at Avalokiteśvara’s feet As if his dear child, An auspicious vision will come to him Before dawn. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་། །མཆོག་སྦྱིན་རང་གཟུགས་སྟོན་མཛད་ཅིང་། །མཆོག་ཉིད་དམ་པ་སྦྱིན་པར་མཛད། །བུད་མེད་དེ་ནི་བུ་སྐྱེད་ཅིང་།
en: Noble Avalokiteśvara, the boon giver, Will appear to him in person And grant him the supreme boon: The woman in question will give birth to a son. “

source: །གཟུགས་བཟང་མཆོག་ཏུ་བལྟ་ན་སྡུག །སྟོབས་ལྡན་གཟུགས་ནི་ཕུན་སུམ་ཚོགས། །ལྷ་ཡི་དཔལ་གྱི་རྗེས་སུ་འགྲོ། །ཆོས་ལྡན་མཁས་ཤིང་གསལ་བ་དང་།
en: The boy will be shapely, Pleasant to look at, strong, Beautiful, and divinely splendorous, And he will follow the Dharma. “

source: །ཚེ་རིང་དབང་ཕྱུག་ཚད་མེད་འགྱུར། །དཔའ་བོ་དགྲ་ལས་རྒྱལ་བ་དང་། །སྡང་བ་ཐམས་ཅད་འཇོམས་པར་འགྱུར།
en: He will be a true paṇḍita, He will live long and have unequaled strength, And he will be a hero who defeats enemies And destroys all wicked beings. “

source: །ཡང་ན་དྲན་པའི་བློ་བསྐྱེད་པར་འདོད་པས་ཐོས་པ་ལ་བརྟེན་ནས་འདུག་ཅིང་རིག་སྔགས་འཆང་གཙང་མ་ཞག་བདུན་དུ་ཉིན་རེ་ཞིང་མར་དང་འོ་མ་བསྐོལ་བ་དེར་རིལ་བུ་བདུན་བཅུག་སྟེ།
en: A vidyā holder who wants to improve his memory and intellect retains whatever he hears. To achieve this, he should purify himself ritually and then boil ghee with milk over a period of seven days, infusing the broth with seven pills each day.

source: ཟན་མ་ཟོས་པའི་སྔོན་རོལ་དུ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱས་ནས་འཇམ་ཙམ་པ་འཐུངས་ལ་ཕྱིས་ཁ་ཟས་བཟའ་བར་བྱ།
en: After incanting the broth twenty-one times as previously instructed, he should let it cool to a comfortable temperature and drink it, taking his food afterward.

source: ཞག་བདུན་གྱིས་ཐོས་པའི་རྒྱ་མཚོ་ཆེན་པོ་བསགས་པར་འགྱུར་ཏེ་བསྟན་བཅོས་ཐམས་ཅད་དང་། ཆོས་ལུགས་དང་། འདུལ་བ་དང་། སྙན་དང་གས་དང་། བརྡ་སྤྲོད་པ་དང་།
en: On the seventh night, he will hear a great sound like that of the ocean.

source: མདོའི་སྡེ་དང་། དབྱངས་ཀྱིས་བསྙད་པའི་སྡེ་དང་། ཚིགས་སུ་བཅད་པའི་སྡེ་དང་། གླེང་གཞིའི་སྡེ་དང་། ཆེད་དུ་བརྗོད་པའི་སྡེ་དང་། དེ་ལྟ་བུ་བྱུང་བའི་སྡེ་དང་། སྐྱེས་པ་རབས་ཀྱི་སྡེ་དང་། ཆོས་མངོན་པར་དང་། རྩིས་དང་། ཆོ་ག་ཞིབ་མོ་དང་།
en: After that, all scientific treatises, all works on polity, discipline, poetry, grammar, the sūtras, songs, aphorisms, udāna, nidāna, stories of past events, the jātakas, the Abhidharma, algebra, mantras, and mudrās and all works of the Mahāyāna will remain on the tip of his tongue. “

source: གསང་སྔགས་དང་། ཕྱག་རྒྱ་ཐམས་ཅད་དང་། ཐེག་པ་ཆེན་པོ་ཐམས་ཅད་ཁ་ཏོན་དུ་ལོབས་པར་འགྱུར་རོ། །ཞག་ཉི་ཤུ་རྩ་གཅིག་ཏུ་སྦྱར་བ་བྱས་ན་སྟོབས་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་གནོན་པར་འགྱུར་ཏེ། གླང་པོ་ཆེ་ཁྲིའི་སྟོབས་སུ་འགྱུར་རོ།
en: After employing this method for twenty-one days, the vidyā holder will acquire great strength, energy, and valor, his strength equaling that of ten thousand elephants.

source: །ཟླ་བ་གཅིག་ཙམ་སྦྱར་བ་བྱས་ན་ལོ་ལྔ་བརྒྱར་འཚོ་ཞིང་གཉེར་མ་དང་། སྐྲ་དཀར་སྤངས་ལ་སྐྲ་ལྕང་ལོ་འཁྱིལ་ཞིང་འཁྱིལ་པར་འགྱུར་བ་དང་། ལུས་ཀྱི་མདོག་དཀར་ཤམ་ལྟ་བུར་འགྱུར་རོ།
en: After a month of practice his lifespan will increase to five hundred years, he will be free of wrinkles and gray hair, his hair will become wavy and curly, and his complexion will assume the white hue of a lotus.

source: །ལོ་གཅིག་ཏུ་སྦྱར་ན་ལྷའི་སྨན་བཅུད་ཀྱིས་ལེན་མཆོག་ལ་འཇུག་ཅིང་ནམ་མཁའི་སྟེང་དུ་ལྷ་རྣམས་དང་ལྷན་ཅིག་མཐུན་པར་འགྱུར་ལ།
en: After a year of practice, he will be able to employ the divine elixir of immortality and will roam the skies together with and in the same way as the devas.

source: བརྒྱ་བྱིན་དང་ཡང་ལྷན་ཅིག་འགྲན་པར་འགྱུར། ལྷ་རྣམས་ཀྱི་ལྷ་མོའི་ཚོགས་དང་། ལྷའི་གཞལ་མེད་ཁང་ན་རྩེ་ཞིང་དགའ་བར་བྱེད་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་གི་གནས་ན་གནས་པར་འགྱུར།
en: Rivaling Śakra, he will engage in divine play and pleasures with the devas and apsarases in their celestial mansions, and he will dwell in a palace built of the seven types of jewels.

source: ཉི་མ་ལྟ་བུར་འོད་གཏོང་ཞིང་རྒྱུ་ལ་གནས་པ་བཟང་པོ་རྣམས་ཀྱིས་འགྲོ་བར་བྱེད།
en: He will roam together with devas who radiate light as bright as the sun, and he will travel from one fine palace to another.

source: གཟི་བརྗིད་ཤིན་ཏུ་གསལ་བ་མི་བཟོད་ཅིང་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: He will shine with pure light, the brilliance of which will be impossible to bear.

source: །ཞེས་བྱ་བ་ལ་ཐེ་ཚོམ་མི་བྱའོ།
en: This will happen without a doubt. “

source: །ལས་ཐམས་ཅད་བསྒྲུབ་པའི་ཐིག་ལེ་དང་། རིལ་བུ་བསྒྲུབ་པའི་ཆོ་ག་སྟེ་བཞི་པའོ།། །།
en: This concludes the fourth practice procedure, the practice of the bindi and the pill that is suitable for all activities. “

source: དེ་ནས་མི་སྣང་བར་བྱ་བ་དང་། ནམ་མཁའ་ལ་འགྲོ་བ་སྨན་གྱི་མཆོག་དོན་ཡོད་པའི་མཐུས་གྲུབ་པར་བཤད་པར་བྱ་སྟེ། རིག་སྔགས་འཆང་བ་རྣམས་ཀྱི་གྲུབ་པའི་མཆོག་དེ་ཁོ་ན་ཉིད་ཡིན་ནོ། །སྨན་དངུལ་ཆུ་དང་། བྲཧྨཱ་ཀྵི་ར་དང་། སུ་བར་ཎ་ཀྵི་ར་དང་། ཤེལ་སྔོ་སངས་དང་། ཀུ་ཀྵི་དང་།
en: I will now teach the magical powers for becoming invisible, for traveling through space, and for the ultimate remedy that together constitute the accomplishment of amogha power.

source: སུ་གན་དྷི་དང་། ཀིང་ཀུཥྛ་སྐྱོན་མེད་པ་དང་། ཨུཏྤལ་བཟང་པོ་དང་། པདྨ་ཀྵ་དང་། གུ་གུལ་དང་།
en: I will teach them accurately for the sake of the vidyā holders’ success. “

source: ཕེ་ལུ་པད་ཏྲ་དང་། གུར་གུམ་དང་། ན་ག་པུཥྤ་དང་བཅས་པ་དང་། སྤང་སྤོས་དང་། ཤི་རི་ཥའི་མེ་ཏོག་དང་།
en: The vidyā holder should procure quicksilver, the sap of brahmā, quartz, śāmakukṣī, sugandhikī, costus, a fine specimen of blue lotus, lotus seeds, bdellium, palu leaves, saffron, nāgapuṣpa, spikenard, and the blossoms of śirīṣa and blend them with nasyasita into a pure, fine powder.

source: ཙནྡན་དཀར་པོ་དང་བཅས་པ་བསྲེས་ནས་ཞིབ་ཏུ་བཏགས་པའི་ཕྱེ་མ་ལ་དོན་ཡོད་པ་པདྨ་གཙུག་ཏོར་གྱི་གསང་བ་རིགས་ཀྱི་རྒྱལ་པོའི་སྔགས་ཀྱིས་ཤིན་ཏུ་བརྩོན་པར་ལན་བརྒྱད་བརྒྱ་བཟླས་བརྗོད་བྱ་ཞིང་ཁྲོ་བོའི་གསང་སྔགས་ལན་བརྒྱད་སྟོང་བཟླས་བརྗོད་བྱས་པས་ལན་ཉི་ཤུ་རྩ་གཅིག་ཏུ་དབང་བསྐུར་ལ།
en: He should incant the mixture with the secret mantra of Amogha­padmoṣṇīṣa, in combination with one thousand and eight recitations of the mantra of the lord of the family. He should then perform the consecration by reciting the mantra of Krodharāja twenty-one times.

source: ཡི་གེ་གཅིག་པ་ལན་འབུམ་བཟླས་བརྗོད་བྱ། དེའི་ཚེ་གཟུངས་སྔགས་བཅུ་བོ་སོ་སོར་ལན་ཉི་ཤུ་རྩར་རེ་བཟླས་བརྗོད་བྱ་སྟེ།
en: After that he should recite the one-syllable mantra one hundred thousand times, and then each of the ten dhāraṇīs twenty-one times. “

source: གསང་སྔགས་ཐམས་ཅད་རྫོགས་པར་བཟླས་བརྗོད་བྱས་ནས་སྨན་དོན་ཡོད་པ་རྒྱ་ཆེ་བ་གསལ་བ་ཞེས་བྱ་བ་སྨན་གྱི་མཆོག །བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་དྲུང་དུ་བཞག་ལ་གྲིབ་མ་ལ་བསྐམ་པར་བྱའོ།
en: When the vidyā holder has finished reciting all these mantras in full, he should place the ultimate remedy, called the remedy possessing the extensive amogha splendor, at the feet of Noble Lord Avalokiteśvara and dry it in his shadow.

source: །ཡང་དོན་ཡོད་པའི་ཞགས་པའི་གཙུག་ཏོར་གྱིས་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས་སྣོད་གཙང་མའི་ནང་དུ་བཅུག་ལ་ནམ་དགོས་པ་བྱུང་བ་དེའི་ཚེ་ཐམས་ཅད་དུ་བསྒྲུབ་པའི་དགོས་པ་ཐམས་ཅད་ལ་སྦྱར་བར་བྱའོ།
en: He should recite, again, the mantra of Amogha­pāśoṣṇīṣa one hundred and eight times and put the remedy in a clean pouch. He should employ it whenever there is a need to perform any task, and he will succeed in all tasks. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མར་གྱུར་པས་ལུས་ལེགས་པར་ཁྲུས་བྱས་ལ་སྤོས་ཆུས་བྱུགས་ཏེ། གོས་གཙང་མ་བགོ་བར་བྱ།
en: The vidyā holder should purify himself ritually, bathe, put on clean clothes, and perfume his body.

source: སྨན་གྱི་མཆོག་འདི་ཡུངས་མར་གྱིས་སྦྲུས་ལ་རང་གི་ལུས་ལ་བྱུག་པར་བྱ་སྟེ། ལན་ཅིག་བསྐུས་པ་ཙམ་གྱིས་མི་སྣང་བར་འགྱུར་ལ།
en: He should then mix the ultimate remedy with mustard oil and smear it on his body, which will render him invisible.

source: གནས་གསང་བར་བྱ་བའི་སྒོ་བཅད་པ་ཐམས་ཅད་མཐོང་བར་འགྱུར། གནས་ཐམས་ཅད་དུ་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འཇུག་པར་འགྱུར། དོན་ཐམས་ཅད་བྱེད་པར་འགྱུར། འབྱུང་པོ་དང་།
en: The doors to all secret dwelling places will open for him, and he will be able to enter them at will and accomplish all his tasks.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཤ་ཟ་ལ་སོགས་པའི་གཙོ་བོ་རྒྱལ་པོར་འགྱུར་ཞིང་དེ་དག་ཐམས་ཅད་དབང་དུ་འགྱུར་ཏེ།
en: He will become a mighty king of all beings—yakṣas, rākṣasas, bhūtas, piśācas, and so forth—who will all fall under his thrall and attend upon him as his servants for as long as he lives.

source: ཅི་བགྱི་ཞེས་བྱ་བ་བྱེད་ལ་ཇི་སྲིད་འཚོའི་བར་དུ་ཉེ་བར་གནས་ནས་ལས་སུ་བྱ་བའི་དགོས་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ།
en: He will be able to perform any task.

source: །ཀླུའི་གནས་ཀྱི་སྒོ་བཅད་པ་ཐམས་ཅད་ན་འདུག་ལ་ཀླུ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་མདུན་དུ་འཁོད་ནས་བྱ་བ་ཐམས་ཅད་ལ་ཅི་བགྱི་ཞེས་བྱ་བ་བྱེད་པར་འགྱུར་ཞིང་ལས་སུ་བྱེད་པ་དང་།
en: The doors to all nāga palaces will remain open for him, and all the nāgas with their retinues will wait in attendance as his attentive servants, ready to perform any task.

source: དགོས་པ་ཐམས་ཅད་བྱེད་པར་འགྱུར། ཇི་སྲིད་འཚོའི་བར་དུ་ཉེ་བར་འཁོད་ཅིང་ཉིན་མཚན་དུ་གནས་ལ།
en: They will perform anything that needs to be done, wait in attendance day and night, and continue to follow his orders for as long as he lives. “

source: དེ་ནས་ཀླུ་ཐམས་ཅད་བསྒོ་བ་བཞིན་བྱེད་པར་འགྱུར་རོ། །སྨན་ལ་སིང་ཧ་ཛི་ཧྭ་དང་། བའི་འོ་མ་དང་སྦྱར་བས་མགོ་ཀུན་བྱུགས་ན་ཇི་ལྟ་བ་ཡིད་ལ་བྱས་པ་དང་། རང་གི་བློས་འདོད་པའི་ངོ་བོ་སྣ་ཚོགས་པར་བྱེད་དོ།
en: If he mixes the remedy with siṃhajihvā and cow’s milk and anoints his entire head with the mixture, he will be able to manifest whatever various forms he may think of and that seem pleasant to him.

source: །གནས་སུ་གཏོགས་པ་ཐམས་ཅད་ཇི་ལྟར་འདུག་པ་བཞིན་སྟོན་པར་བྱེད།
en: He will take whatever form corresponds to the forms beings take in their respective locations.

source: གནས་སུ་གཏོགས་པ་ཐམས་ཅད་འཁོར་གྱི་ནང་ན་ཇི་ལྟར་རྣམ་པར་སྤྲུལ་པའི་གཟུགས་སྣ་ཚོགས་སྟོན་པར་བྱེད། ཇི་སྲིད་འཚོའི་བར་དུ་འཕེལ་བ་རྣམས་སྟོན་པར་བྱེད་ཅིང་བྱ་བ་ཐམས་ཅད་བྱེད་དོ།
en: In all places, such as in the midst of an assembly, he will be able to appear in various emanated forms and sustain them for as long as he lives, and he will be able to perform every task.

source: །སྤོས་ཀྱི་ཏིལ་མར་དང་སྦྲུས་ནས་བྱིན་པ་དང་། རྐང་པ་ལ་བསྐུས་ན་ནམ་མཁའ་ལ་འཕགས་པར་འགྱུར་ཞིང་།
en: If he mixes the remedy with castor oil and anoints his feet and calves with it, he will rise into the air and move through space.

source: ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་ལ་གང་དུ་འདོད་པ་དེར་འགྲོ་བར་འགྱུར། ཆུའི་སྟེང་དུ་འགྲོ་ཞིང་ནམས་ཀྱང་ཕྱིས་ས་ལ་རྐང་པ་འཇོག་པར་མི་འགྱུར།
en: He will be able to go wherever he wants, walk on water, and walk without touching the ground with his feet.

source: ལག་པ་གཡས་པ་ལ་བསྐུས་ན་གང་དང་གང་ལ་ལག་པ་རེག་པ་དེ་འོང་བར་འགྱུར་ལ་སུས་ཀྱང་མཐོང་བར་མི་འགྱུར།
en: If he anoints his right hand, he will be able to whisk away whatever he touches, and no one will see it. “

source: བུད་མེད་གཞོན་ནུའི་འོ་མ་དང་བསྲེས་ནས་མིག་ལ་བསྐུས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཞུགས་ན་མཐོང་བར་མི་འགྱུར་ཞིང་དོན་འདོད་པ་གང་ཡིན་པ་བྱེད་དོ། །དོན་གྱི་རྫས་གང་ཡིན་པ་བླངས་ཀྱང་སུས་ཀྱང་མི་མཐོང་ངོ་།
en: If he anoints his eyes with the remedy after it has been mixed with the milk of a young woman and then enters a royal household, he will be invisible and able to carry out any task he wants.

source: །བུད་མེད་གང་དང་ཕྲད་ན་སུས་ཀྱང་མི་མཐོང་ལ་ཇི་སྲིད་འཚོའི་བར་དུ་འདུག་ཀྱང་མི་ཤེས་སོ།
en: He will be able to take any objects of value without being seen, and he will remain unseen when cavorting with any woman. He may stay there as long as he lives, and no one will know.

source: །ཁར་བྱུགས་ནས་གང་དང་གང་ན་བྲོ་གར་བྱེད་པ་དང་། བཞད་གད་བྱེད་པ་ཉིད་ཀྱི་ནང་དུ་ཞུགས་ན་བྱ་བ་ཐམས་ཅད་བྱེད་ལ་ལུས་ནི་སུས་ཀྱང་མི་མཐོང་ངོ་།
en: If he anoints his face, he will be able to take part in any theatrical performance or perform comedic acts without his body being seen.

source: །བུམ་པ་ལ་བྱུགས་ནས་ཆུས་བཀང་ན་ཆུའི་རྒྱུན་སྣང་ལ་བུམ་པ་དེ་ནི་མི་མངོན་ནོ།
en: If he anoints a pitcher and fills it with water, the stream of water will be visible, but the pitcher will not.

source: །གཞོང་པ་ཆུས་བཀང་བ་དེའི་དབུས་སུ་བྱུགས་ན་ཆུ་དེ་གང་བར་སྣང་ལ་གཞོང་པ་དེ་ནི་མི་སྣང་ངོ་།
en: If he fills a tank with water and steps into it, he will be seen floating on the water, but the tank will be invisible.

source: །བདག་ཉིད་ལ་བྱུགས་ནས་བུམ་པ་ཆུས་བཀང་བ་ལག་ན་ཐོགས་ན་བུམ་པ་ལས་ཆུ་འབྱུང་བ་ནི་སྣང་ལ་མི་དེའི་ལུས་ནི་མི་སྣང་ངོ་།
en: If he anoints his body and holds a pitcher filled with water in his hand, the pitcher and the stream of water will be visible, but the person holding it will not. “

source: །མིག་ལ་བསྐུས་ནས་སྐྱེ་བོ་མང་པོའི་ནང་དུ་ཞུགས་ན་མི་མཐོང་བར་འགྱུར་ལ།
en: If he anoints his eyes, he will be invisible when entering a crowd of people.

source: དེའི་སྒྲ་ནི་ཐོས་ཤིང་རང་གི་ལུས་ནི་མི་མངོན་ནོ།
en: His voice will be heard, but his body will be invisible.

source: །གནས་སུ་གཏོགས་པ་ཐམས་ཅད་དུ་ཞུགས་ན་རང་གི་ལུས་ཁྲུས་མ་བྱས་ཀྱི་བར་དུ་མི་མཐོང་ངོ་།
en: Until he washes off the remedy, he will be able to enter any place without his body being seen.

source: །སུ་ཡང་རུང་བའི་མིག་ལ་བསྐུས་ལ་ལུས་ལ་ཡང་བསྐུས་ན་དེ་དག་ཐམས་ཅད་མི་མཐོང་བར་འགྱུར་ཞིང་།
en: Anyone whose eyes and bodies are anointed will become invisible.

source: གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེར་མི་སྣང་བར་འགྱུར་ལ་ཁྲུས་བྱས་པ་ཙམ་གྱིས་ཕྱིར་སྣང་བར་འགྱུར་རོ།
en: The vidyā holder will be invisible wherever he goes; however, he will be visible again as soon as he washes himself.

source: །ལུས་ཀུན་ལ་བསྐུས་ནས་མཛོད་ཆེན་པོའི་ནང་དུ་ཞུགས་ན་མི་མཐོང་བར་འགྱུར་ལ་གསེར་དང་། དངུལ་དང་། ཕྲ་མེན་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བྱི་རུ་དང་། དུང་དང་། མན་ཤེལ་དང་། རྡོ་རྗེ་དང་། བཻ་ཌཱུརྱ་དང་། མ་རྒད་དང་། མཐོན་ཀ་དང་། གོས་དང་། སྤུད་པ་དང་། རྒྱན་དང་།
en: If he anoints his entire body and enters the great treasury, he will be invisible, able to take whatever he desires—all the gold and silver coins, jewels, pearls, coral, conch, crystal, diamonds, beryls, emeralds, sapphires, gold, clothes, jewelry, ornaments, and adornments—and leave without being seen.

source: ལྷབ་ལྷུབ་གང་ཡང་རུང་བ་ཉིད་འདོད་ན་ཐམས་ཅད་བླངས་ནས་སོང་ན་སུས་ཀྱང་མི་མཐོང་ལ་གར་དགའ་བར་འགྲོ་བར་འགྱུར་རོ།
en: He can thus whisk away anything that he wants.

source: །ཇི་སྲིད་དུ་ཁྲུས་མ་བྱས་པ་དེ་སྲིད་དུ་རང་མི་མཐོང་ལ་ཁྲུས་བྱས་ན་ཐམས་ཅད་དུ་མཐོང་ངོ་།
en: He will remain invisible until he washes himself, and then he will be visible as always. “

source: །རིག་སྔགས་འཆང་བུད་མེད་ཀྱི་ནང་དུ་འཇུག་པར་འདོད་པས་གཙང་མར་ཁྲུས་བྱའོ། །དེ་ནས་སྤོས་ཆུས་ཁྲུས་བྱའོ། །དེའི་འོག་ཏུ་བ་གཅིན་གྱིས་ཁྲུས་བྱའོ།
en: If he wants to enter the women’s quarters, he should purify himself ritually, bathe well, and sprinkle himself with perfumed water.

source: །ཡང་ན་གུར་གུམ་གྱིས་ཁྲུས་བྱའོ། །དེའི་འོག་ཏུ་བའི་རྣམ་ལྔས་ཁྲུས་བྱའོ།
en: He should douse himself with cow urine, followed by saffron water and the five products of the cow.

source: །དེའི་འོག་ཏུ་བའི་ཏིལ་མར་དང་ལྷན་ཅིག་བསྲེས་པ་དེས་ལུས་བསྐུ་བར་བྱའོ། །དེའི་འོག་ཏུ་བུད་མེད་གཞོན་ནུའི་ནུ་ཞོ་དང་སྦྱར་བས་མིག་ལ་བསྐུས་ལ་དེ་ནས་རིལ་བུ་གསུམ་དཔུང་པ་གཡས་པ་ལ་གདགས་པར་བྱའོ།
en: He should then rub his body with the pill mixed with scented oil, anoint his eyes with the same pill mixed with the milk of a young woman, tie three pills to his right arm, and put on clean clothes.

source: །དེ་ནས་གོས་གཙང་མ་བགོས་ནས་གསང་སྔགས་བརྗོད་ཅིང་དྲན་པར་བྱས་ལ་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཞུགས་ན་མི་མཐོང་བར་འགྱུར་ཏེ་ལུས་སུས་ཀྱང་མི་མཐོང་ངོ་།
en: If he then enters the royal household while silently reciting the mantra, he will be invisible and unseen.

source: །ཉི་མ་གཅིག་གམ། ཉི་མ་གཉིས་སམ། ཉི་མ་བདུན་ནམ། ཉི་མ་བཅུ་བཞིའམ། ཉི་མ་ཉི་ཤུ་རྩ་གཅིག་ཏུ་ཁྲུས་བྱས་ལ་བུད་མེད་དེ་དག་གི་ནང་ན་རྩེ་ཞིང་དགའ་བར་བྱེད་ལ།
en: Keeping his body doused in this way, he can remain in the female quarters for one or two days, or for one, two, or three weeks, and spend his time playing, having sex, and roaming about without anyone noticing.

source: ཡོངས་སུ་སྤྱོད་པར་བྱེད་ཀྱང་སུས་ཀྱང་མི་ཤེས་ལ་འཇུག་ཅིང་ཕྱིར་འགྲོ་བ་ན་སུས་ཀྱང་གླགས་མི་རྙེད་དེ།
en: He will be able to leave and enter without being confronted.

source: ཇི་སྲིད་དུ་ཁྲུས་མ་བྱས་པའི་བར་དུ་རང་གི་ལུས་མི་སྣང་བར་འགྱུར་རོ།
en: He will remain invisible for as long as he does not wash. “

source: །ཕུག་ཏུ་འཇུག་ན་ལུས་ཀུན་སྤོས་ཀྱི་ཏིལ་མར་གྱིས་བྱུགས་ལ་ཕུག་ཏུ་ཞུགས་ན་ཕུག་གི་སྒོ་ཐམས་ཅད་ཕྱེ་བར་འགྱུར་གྱིས།
en: If the vidyā holder wants to enter terrestrial passages, he should anoint his entire body with the scented oil and enter the opening. The doors to all such passages will be open for him.

source: གནས་དེའི་ནང་དུ་ཞུགས་ལ་ཇི་ལྟ་ཇི་ལྟར་ལས་སུ་བྱ་བ་དེ་ལྟ་དེ་ལྟར་གྱིས་ཤིག །
en: He should enter the palaces there and do whatever actions are appropriate.

source: ཆུའི་ནང་དུ་ཞུགས་ན་ཇི་ལྟར་ཁྱིམ་གྱི་ནང་ན་འདུག་པ་བཞིན་ཆུས་མི་རླན་ལ། ཆུས་གོས་པར་ཡང་མི་འགྱུར་རོ།
en: He can enter water without getting wet as if it were a house, and the beings inhabiting the water will not be able to see him.

source: །མེའི་ནང་དུ་ཞུགས་ན་མེས་ལུས་ལ་མི་རེག་ཅིང་ཙནྡན་ལྟར་བསིལ་བར་འགྱུར་རོ།
en: He can, likewise, enter into fire, but the fire will not touch his body; it will instead feel as cool as sandalwood.

source: །ཀླུའི་གནས་མཚོར་ཞུགས་ན་གནས་ན་འཁོད་པ་རྣམས་ཀྱིས་དེ་མི་མཐོང་གིས་ཇི་ལྟར་རང་གིས་ཡིད་ལ་ལས་སུ་བྱ་བར་འདོད་པའི་ལས་ཀྱི་རྣམ་པ་གཞན་དག་ཀྱང་གྱིས་ཤིག །
en: He can enter the palaces of nāgas, but the nāgas living there will not see him. He can also perform various other feats and do whatever comes to mind. “

source: མི་སྣང་བར་བྱ་བ་རིལ་བུ་སྒྲུབ་པའི་ཆོ་གའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་བཅུ་དྲུག་པ།
en: This concludes the practice instructions for becoming invisible by means of the pill. “

source: དེ་ནས་སྦྱིན་སྲེག་གི་ཆོ་ག་བཤད་པར་བྱ་སྟེ། ལས་ཐམས་ཅད་ཀྱི་དོན་སྒྲུབ་པར་བྱེད་པ། དངོས་གྲུབ་ཐམས་ཅད་བྱེད་པའི་གནས།
en: Now I will teach the homa procedure whereby all activities can be successfully accomplished.

source: སྡིག་པ་ཐམས་ཅད་འཕྲོག་པ། དེ་བཞིན་དུ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པ། རིག་སྔགས་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་བླ་ན་མེད་པ། གནོད་སྦྱིན་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། སྡིག་པ་ཐམས་ཅད་འཇོམས་པར་བྱེད་པ།
en: It is a procedure that produces every accomplishment, removes all evil, and purifies all obscurations.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ལེགས་པར་རྒྱལ་བ་སྦྱིན་པ། དགྲ་ཐམས་ཅད་ཟློག་པར་བྱེད་པ། འཐབ་པ་དང་། རྩོད་པ་ཉིད་དང་། འགྱེད་པ་དང་།
en: It ensures the supreme accomplishment of the vidyā, pacifies all yakṣas, destroys all vices, grants the auspicious victory of the buddhas, wards off all opponents in the event of quarrel, discord, or dispute, and effectively rescues those who are cornered in battle.

source: མཚོན་ཆའི་དྲ་བ་ཐམས་ཅད་ལས་སྒྲོལ་བར་བྱེད་པ། གྲུབ་པ་དོན་ཡོད་པ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བ།
en: For all vidyā holders it unfailingly produces all the supreme accomplishments that are so difficult to obtain.

source: རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་ཐམས་ཅད་དུ་གསང་སྔགས་དང་དཀྱིལ་འཁོར་གྱི་དངོས་གྲུབ་ཕྱག་རྒྱ་འཕོ་བ་དང་།
en: It allows one to accomplish all the mantras and maṇḍalas. When the vidyā holder passes from this world, it will provide him with the means to realize the true state.

source: དེ་ཁོ་ན་ཉིད་ཀྱི་རིམ་པར་ཕྱེ་བའི་སྒྲུབ་པ་ལས་ཐམས་ཅད་དུ་མཆོག་གི་དངོས་གྲུབ་ཀྱང་འགྲུབ་སྟེ་འདི་ལ་ཐེ་ཚོམ་མེད་དོ།
en: There can be no doubt that it will bring every supreme accomplishment. “

source: །བདེ་བ་ཐམས་ཅད་རྟག་ཏུ་རབ་ཏུ་སྦྱིན་པ་དང་། དབང་ཕྱུག་མ་ཡིན་པ་ཐམས་ཅད་ཀྱི་སྒྲུབ་པ་དང་འགུགས་པ་དང་།
en: This practice will certainly bring complete happiness, cure all lack of power, and perform the activity of attracting.

source: ལྷ་དང་། ཀླུ་ཐམས་ཅད་སྤྱན་འདྲེན་པ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ་དང་། བདུད་དང་། འབྱུང་པོ་དང་།
en: It will summon devas and nāgas, destroy yakṣas and rākṣasas, and suppress all vighnas, māras, bhūtas, piśācas, terrible grahas, apasmāras, and terrible brahmarākṣasas.

source: ཤ་ཟ་དང་། གདོན་མི་བཟད་པ་དང་། བརྗེད་བྱེད་མི་བཟད་པ་དང་། ཚངས་པའི་སྲིན་པོ་རྣམས་ཐམས་ཅད་ཐམས་ཅད་དུ་སྒྲོལ་བར་བྱེད་པར་གྲུབ་པ་དང་། ཉིན་མོ་དང་མཚན་མོའི་དུས་རྟག་ཏུ་ཚར་གཅོད་པར་ཐེ་ཚོམ་མེད་དོ།
en: It effectively removes all obstacles at all times, day and night; there can be no doubt about this.

source: །རིམས་ཐམས་ཅད་རྟག་ཏུ་རབ་ཏུ་ཞི་བར་བྱེད་པ། ནད་ཐམས་ཅད་ཟློག་པར་བྱེད་པ། དུག་ཐམས་ཅད་གསོད་པར་བྱེད་པ། འཕྲལ་དུ་སྲེག་བླུགས་བྱིན་པ་ཙམ་གྱིས་ཐམས་ཅད་དུ་རྟག་ཏུ་གནང་ཆེན་པོ་དང་།
en: It cures every fever, prevents every disease, and instantly neutralizes every poison.

source: ཐམས་ཅད་དུ་མཐོང་ན་དགའ་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བླ་མར་མཆོད་པར་བྱ་བ་དང་།
en: As soon as the homa is offered, the vidyā holder is certain to be universally loved and universally welcomed.

source: ཐམས་ཅད་དུ་སྟོབས་དང་། བརྩོན་འགྲུས་དང་ཕ་རོལ་གནོན་པ་དང་།
en: He will become everyone’s revered master and be constantly endowed with strength, energy, and valor.

source: དེ་བཞིན་གཤེགས་པ་རྟག་ཏུ་མཐོང་བ་ཡང་སྦྱིན་པར་འགྱུར་ཏེ་འདི་ལ་ཐེ་ཚོམ་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་ཀུན་དུ་སྣང་བ་དང་། དུས་ཐམས་ཅད་ཀྱི་ཚེ་ལས་ཐམས་ཅད་ལ་ཤིན་ཏུ་དགའ་བ་དང་།
en: The tathāgatas will always appear to him—there can be no doubt about this—and bodhisattvas will always watch over him during all his activities. “

source: སྐྱེ་བ་ནས་སྐྱེ་བར་ཚིག་བཙུན་པར་འགྱུར་རོ།
en: Birth after birth, such a vidyā holder will be pleasant to interact with and have an agreeable way of speaking.

source: །ཐམས་ཅད་དུ་བླ་མ་ལ་སྲི་ཞུ་ཆེ་བ་དང་། ཐམས་ཅད་དུ་མཆོད་པར་འོས་པའི་བླ་མའོ།
en: Always eager to obey his master, he will himself become a universally respected teacher.

source: །དེ་ནས་དཔལ་ལྡན་རྡོ་རྗེ་འཛིན་པས་རྟག་ཏུ་ཡང་སྲུང་བ་དང་། ཡོངས་སུ་སྐྱོང་བར་བྱེད་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་ཉིད་ཀྱིས་ཀྱང་། དུས་རྟག་ཏུ་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦ་བར་བྱེད་པར་ཐེ་ཚོམ་མེད་དོ།
en: The glorious Vajradhara will always watch over and protect him during armed conflicts, and the Four Great Kings, Yama, and Varuṇa will always guard, protect, and defend him; there can be no doubt about this.

source: །དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ལྷའི་བུ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དང་། ལྷའི་བུ་རྫུ་འཕྲུལ་ཆེ་བ་རྣམས་ཀྱིས་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦ་བར་བྱེད་ཅིང་རྟག་ཏུ་ལེགས་པར་ཁ་ལོས་སྒྱུར་བར་གནས་པར་འགྱུར་རོ། །ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དྲག་པོ་དང་། གཞོན་ནུ་དང་། ནོར་བུ་བཟང་པོ་དང་།
en: Īśvara, Maheśvara, the ninety-nine thousand divine sons, and other gods of great power will stand by, well disciplined, in order to guard, protect, and defend him.

source: སྟོབས་ཀྱི་ལྷ་དང་། གང་བ་བཟང་པོ་དང་། ལྔས་རྩེན་དང་། གར་མཁན་མཆོག་སྟེ་འདི་རྣམས་ཀྱིས་རྟག་ཏུ་སྲུང་བ་དང་། སྐྱོབ་པར་བྱེད་ཅིང་གནས་ཏེ་འདི་ལ་ཐེ་ཚོམ་མེད་དོ།
en: Brahmā, Viṣṇu, Maheśvara, Rudra, Kumāra, Maṇibhadra, Baladeva, Pūrṇabhadra, and Pāñcika, the supreme dancer, will always stand by to guard and protect him; there can be no doubt about this.

source: །མེའི་ལྷ་གཟི་བརྗིད་ཆེན་པོ་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། རྒྱུ་སྐར་གྱི་ལྷ་རྣམས་ཀྱིས་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦ་བར་བྱེད་ཅིང་།
en: The god Agni of great brilliance, Sūrya, Candra, and the nakṣatra deities will all guard, protect, and defend him constantly, and they will honor him with offerings. “

source: མཆོག་ཏུ་མཆོད་པ་བྱེད་པས་གནས་པར་འགྱུར་རོ། །སྦྱིན་སྲེག་ཙམ་འདི་ནི། བྱ་བ་ཐམས་ཅད་བླ་ན་མེད་པའི་དངོས་གྲུབ་རྣམས་ལའོ། །འབྲས་ཐུག་པོ་ཆེ་དང་། ཡུངས་ཀར་དང་།
en: This homa rite alone is sufficient to ensure supreme success in every endeavor.

source: གུ་གུལ་དང་། མར་དང་སྦྲང་རྩི་བསྲེས་པས་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཐམས་ཅད་མཆོག་སྦྱིན་པར་འགྱུར་ཏེ། བྱ་བ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པར་འགྱུར་རོ། །ཙནྡན་དང་། པདྨའི་ཆུ་བ་དང་། འབྲས་ཡོས་དང་། ཡུངས་ཀར་དང་། ཨ་ག་རུ་དང་།
en: If the vidyā holder offers one thousand and eight individual homas of rice grains and mustard seeds with an admixture of bdellium, ghee, and honey, he will receive every boon from Noble Avalokiteśvara and will succeed in all his endeavors.
